#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_custom_role.velero will be created
  + resource "google_project_iam_custom_role" "velero" {
      + deleted     = (known after apply)
      + description = "This role grants all required Velero permissions"
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "compute.disks.create",
          + "compute.disks.createSnapshot",
          + "compute.disks.get",
          + "compute.snapshots.create",
          + "compute.snapshots.delete",
          + "compute.snapshots.get",
          + "compute.snapshots.useReadOnly",
          + "compute.zones.get",
        ]
      + project     = (known after apply)
      + role_id     = "velero"
      + stage       = "GA"
      + title       = "Velero Role"
    }

  # google_service_account.velero will be created
  + resource "google_service_account" "velero" {
      + account_id   = "velero"
      + display_name = "Service account for Velero"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_binding.velero will be created
  + resource "google_service_account_iam_binding" "velero" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = (known after apply)
      + role               = (known after apply)
      + service_account_id = (known after apply)
    }

  # google_storage_bucket.thanos will be created
  + resource "google_storage_bucket" "thanos" {
      + bucket_policy_only          = (known after apply)
      + default_event_based_hold    = false
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA"
      + name                        = "thanos-raspbernetes-storage"
      + project                     = "raspbernetes"
      + requester_pays              = false
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket.velero will be created
  + resource "google_storage_bucket" "velero" {
      + bucket_policy_only          = (known after apply)
      + default_event_based_hold    = false
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA"
      + name                        = "raspbernetes-velero-backups"
      + project                     = "raspbernetes"
      + requester_pays              = false
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @xUnholy, Action: `pull_request`, Working Directory: `infrastructure/gcp`, Workflow: `terraform`*